dltech/headphones/lib/cc2640_reg/fcfg_reg.h
#ifndef H_FCFG_REGS
#define H_FCFG_REGS
/*
 * Simple CC2640 headphones
 * Device Configuration registers
 *
 * Copyright 2022 Mikhail Belkin <dltech174@gmail.com>
 *
 * Licensed under the Apache License, Version 2.0 (the "License");
 * you may not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 *
 *     http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS,
 * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 */
#include "memorymap.h"

/* Extern LF clock configuration */
#define EXT_LF_CLK          MMIO32(CCFG + 0xfa8)
// Unsigned integer, selecting the DIO to supply external 32kHz clock as SCLK_LF
#define DIO_SFT             24
#define DIO_MSK             0xff
// Unsigned integer, defining the input frequency of the external clock.
#define RTC_INCREMENT_SFT   0
#define RTC_INCREMENT_MSK   0xffffff

/* Mode Configuration 1 */
#define MODE_CONF_1         MMIO32(CCFG + 0xfac)
// Minimum voltage for when DC/DC should be used if alternate DC/DC setting isen
#define ALT_DCDC_VMIN_1P75      0x00000000
#define ALT_DCDC_VMIN_1P81      0x00100000
#define ALT_DCDC_VMIN_1P88      0x00200000
#define ALT_DCDC_VMIN_1P94      0x00300000
#define ALT_DCDC_VMIN_2P00      0x00400000
#define ALT_DCDC_VMIN_2P06      0x00500000
#define ALT_DCDC_VMIN_2P13      0x00600000
#define ALT_DCDC_VMIN_2P19      0x00700000
#define ALT_DCDC_VMIN_2P25      0x00800000
#define ALT_DCDC_VMIN_2P31      0x00900000
#define ALT_DCDC_VMIN_2P38      0x00a00000
#define ALT_DCDC_VMIN_2P44      0x00b00000
#define ALT_DCDC_VMIN_2P50      0x00c00000
#define ALT_DCDC_VMIN_2P56      0x00d00000
#define ALT_DCDC_VMIN_2P63      0x00e00000
#define ALT_DCDC_VMIN_2P69      0x00f00000
#define ALT_DCDC_VMIN_SFT       20
#define ALT_DCDC_VMIN_MSK       0xf
// Enable DC/DC dithering if alternate DC/DC setting is enabled.
#define ALT_DCDC_DITHER_EN      0x00080000
// Inductor peak current if alternate DC/DC setting is enabled.
#define ALT_DCDC_IPEAK_31M      0x00000000
#define ALT_DCDC_IPEAK_35M      0x00010000
#define ALT_DCDC_IPEAK_39M      0x00020000
#define ALT_DCDC_IPEAK_43M      0x00030000
#define ALT_DCDC_IPEAK_47M      0x00040000
#define ALT_DCDC_IPEAK_51M      0x00050000
#define ALT_DCDC_IPEAK_55M      0x00060000
#define ALT_DCDC_IPEAK_59M      0x00070000
#define ALT_DCDC_IPEAK_SFT      16
#define ALT_DCDC_IPEAK_MSK      0x7
// Signed delta value for IBIAS_INIT.
#define DELTA_IBIAS_INIT_SFT    12
#define DELTA_IBIAS_INIT_MSK    0xf
// Signed delta value for IBIAS_OFFSET.
#define DELTA_IBIAS_OFFSET_SFT  8
#define DELTA_IBIAS_OFFSET_MSK  0xf
// Unsigned value of maximum XOSC startup time (worst case) in units of 100us.
#define XOSC_MAX_START_SFT      0
#define XOSC_MAX_START_MSK      0xff

/* CCFG Size and Disable Flags */
#define SIZE_AND_DIS_FLAGS  MMIO32(CCFG + 0xfb0)
// Total size of CCFG in bytes.
#define SIZE_OF_CCFG_SFT        16
#define SIZE_OF_CCFG_MSK        0xffff
// Reserved for future use.
#define DISABLE_FLAGS_SFT       8
#define DISABLE_FLAGS_MSK       0xff
// Disable TCXO.
#define DIS_TCXO                0x00000008
// Disable GPRAM (or use the 8K VIMS RAM as CACHE RAM).
#define DIS_GPRAM               0x00000004
// Disable alternate DC/DC settings.
#define DIS_ALT_DCDC_SETTING    0x00000002
// Disable XOSC override functionality.
#define DIS_XOSC_OVR            0x00000001

/* Mode Configuration 0 */
#define MODE_CONF           MMIO32(CCFG + 0xfb4)
// Signed delta value to apply to the VDDR_TRIM_SLEEP target, minus one.
#define VDDR_TRIM_SLEEP_DELTA_M7    0x80000000
#define VDDR_TRIM_SLEEP_DELTA_M6    0x90000000
#define VDDR_TRIM_SLEEP_DELTA_M5    0xa0000000
#define VDDR_TRIM_SLEEP_DELTA_M4    0xb0000000
#define VDDR_TRIM_SLEEP_DELTA_M3    0xc0000000
#define VDDR_TRIM_SLEEP_DELTA_M2    0xd0000000
#define VDDR_TRIM_SLEEP_DELTA_M1    0xe0000000
#define VDDR_TRIM_SLEEP_DELTA_M0    0xf0000000
#define VDDR_TRIM_SLEEP_DELTA_1     0x00000000
#define VDDR_TRIM_SLEEP_DELTA_2     0x10000000
#define VDDR_TRIM_SLEEP_DELTA_3     0x20000000
#define VDDR_TRIM_SLEEP_DELTA_4     0x30000000
#define VDDR_TRIM_SLEEP_DELTA_5     0x40000000
#define VDDR_TRIM_SLEEP_DELTA_6     0x50000000
#define VDDR_TRIM_SLEEP_DELTA_7     0x60000000
#define VDDR_TRIM_SLEEP_DELTA_8     0x70000000
#define VDDR_TRIM_SLEEP_DELTA_SFT   28
#define VDDR_TRIM_SLEEP_DELTA_MSK   0xf
// DC/DC during recharge in powerdown.
#define DCDC_RECHARGE               0x08000000
// DC/DC in active mode.
#define DCDC_ACTIVE                 0x04000000
// Reserved for future use.
#define VDDR_EXT_LOAD               0x02000000
// VDDS BOD level.
#define VDDS_BOD_LEVEL              0x01000000
// Select source for SCLK_LF.
#define SCLK_LF_OPTION_31P25        0x00000000
#define SCLK_LF_OPTION_EXT          0x00400000
#define SCLK_LF_OPTION_31P768       0x00800000
#define SCLK_LF_OPTION_RCOSC        0x00c00000
// 0x0: RTOS/driver temperature compensates
#define VDDR_TRIM_SLEEP_TC          0x00200000
// Reserved for future use.
#define RTC_COMP                    0x00100000
// Reserved for future use.
#define XOSC_FREQ_HPOSC             0x00040000
#define XOSC_FREQ_48M               0x00080000
#define XOSC_FREQ_24M               0x000c0000
// Enable modification (delta) to XOSC cap-array.
#define XOSC_CAP_MOD                0x00020000
// Reserved for future use.
#define HF_COMP                     0x00010000
// Signed 8-bit value, directly modifying trimmed XOSC cap-array step value.
#define XOSC_CAPARRAY_DELTA_SFT     8
#define XOSC_CAPARRAY_DELTA_MSK     0xff
// The minimum decoupling capacitance (worst case) on VDDR, in units of 100nF.
#define VDDR_CAP_SFT                0
#define VDDR_CAP_MSK                0xff

/* Voltage Load 0 */
#define VOLT_LOAD_0         MMIO32(CCFG + 0xfb8)
// Reserved for future use.
#define VDDR_EXT_TP45_MSK   0xff
#define VDDR_EXT_TP45_SFT   24
// Reserved for future use.
#define VDDR_EXT_TP25_MSK   0xff
#define VDDR_EXT_TP25_SFT   16
// Reserved for future use.
#define VDDR_EXT_TP5_MSK    0xff
#define VDDR_EXT_TP5_SFT    8
// Reserved for future use.
#define VDDR_EXT_TM15_MSK   0xff
#define VDDR_EXT_TM15_SFT   0

