dltech/headphones/lib/cc2640_reg/fcfg_reg.h
/* Voltage Load 1 */
#define VOLT_LOAD_1         MMIO32(CCFG + 0xfbc)
// Reserved for future use.
#define VDDR_EXT_TP125_MSK  0xff
#define VDDR_EXT_TP125_SFT  24
// Reserved for future use.
#define VDDR_EXT_TP105_MSK  0xff
#define VDDR_EXT_TP105_SFT  16
// Reserved for future use.
#define VDDR_EXT_TP85_MSK   0xff
#define VDDR_EXT_TP85_SFT   8
// Reserved for future use.
#define VDDR_EXT_TM65_MSK   0xff
#define VDDR_EXT_TM65_SFT   0

/* Real Time Clock Offset */
#define RTC_OFFSET          MMIO32(CCFG + 0xfc0)
// Reserved for future use.
#define RTC_COMP_P0_MSK  0xffff
#define RTC_COMP_P0_SFT  16
// Reserved for future use.
#define RTC_COMP_P1_MSK  0xff
#define RTC_COMP_P1_SFT  8
// Reserved for future use.
#define RTC_COMP_P2_MSK  0xff
#define RTC_COMP_P2_SFT  0

/* Frequency Offset */
#define FREQ_OFFSET         MMIO32(CCFG + 0xfc4)
// Reserved for future use.
#define HF_COMP_P0_MSK  0xffff
#define HF_COMP_P0_SFT  16
// Reserved for future use.
#define HF_COMP_P1_MSK  0xff
#define HF_COMP_P1_SFT  8
// Reserved for future use.
#define HF_COMP_P2_MSK  0xff
#define HF_COMP_P2_SFT  0

/* IEEE MAC Address 0 */
#define IEEE_MAC_0          MMIO32(CCFG + 0xfc8)
/* IEEE MAC Address 1 */
#define IEEE_MAC_1          MMIO32(CCFG + 0xfcc)
// ADDR

/* IEEE BLE Address 0 */
#define IEEE_BLE_0          MMIO32(CCFG + 0xfd0)
/* IEEE BLE Address 1 */
#define IEEE_BLE_1          MMIO32(CCFG + 0xfd4)
// ADDR

/* Bootloader Configuration */
#define BL_CONFIG           MMIO32(CCFG + 0xfd8)
// Bootloader enable.
#define BOOTLOADER_ENABLE   0xc5000000
// Sets the active level of the selected DIO number BL_PIN_NUMBER
#define BL_LEVEL            0x00010000
// DIO number that is level checked if the boot loader backdoor is enabled.
#define BL_PIN_NUMBER_SFT   8
#define BL_PIN_NUMBER_MSK   0xff
// Enables the boot loader backdoor.
#define BL_ENABLE           0x000000c5

/* Erase Configuration */
#define ERASE_CONF          MMIO32(CCFG + 0xfdc)
// Chip erase.
#define CHIP_ERASE_DIS_N    0x00000100
// Bank erase.
#define BANK_ERASE_DIS_N    0x00000001

/* TI Options */
#define CCFG_TI_OPTIONS     MMIO32(CCFG + 0xfe0)
// TI Failure Analysis.
#define TI_FA_ENABLE    0xc5

/* Test Access Points Enable 0 */
#define CCFG_TAP_DAP_0      MMIO32(CCFG + 0xfe4)
// Enable CPU DAP.
#define CPU_DAP_ENABLE  0x00c50000
// Enable PRCM TAP.
#define PRCM_TAP_ENABLE 0x0000c500
// Enable Test TAP.
#define TEST_TAP_ENABLE 0x000000c5

/* Test Access Points Enable 1 */
#define CCFG_TAP_DAP_1      MMIO32(CCFG + 0xfe8)
// Enable CPU DAP.
#define PBIST2_TAP_ENABLE 0x00c50000
// Enable PRCM TAP.
#define PBIST1_TAP_ENABLE 0x0000c500
// Enable Test TAP.
#define WUC_TAP_ENABLE    0x000000c5

/* Image Valid */
#define IMAGE_VALID_CONF    MMIO32(CCFG + 0xfec)
// IMAGE_VALID

/* Protect Sectors */
#define CCFG_PROT_31_0      MMIO32(CCFG + 0xff0)
// 0: Sector protected
#define WRT_PROT_SEC_31 0x80000000
#define WRT_PROT_SEC_30 0x40000000
#define WRT_PROT_SEC_29 0x20000000
#define WRT_PROT_SEC_28 0x10000000
#define WRT_PROT_SEC_27 0x08000000
#define WRT_PROT_SEC_26 0x04000000
#define WRT_PROT_SEC_25 0x02000000
#define WRT_PROT_SEC_24 0x01000000
#define WRT_PROT_SEC_23 0x00800000
#define WRT_PROT_SEC_22 0x00400000
#define WRT_PROT_SEC_21 0x00200000
#define WRT_PROT_SEC_20 0x00100000
#define WRT_PROT_SEC_19 0x00080000
#define WRT_PROT_SEC_18 0x00040000
#define WRT_PROT_SEC_17 0x00020000
#define WRT_PROT_SEC_16 0x00010000
#define WRT_PROT_SEC_15 0x00008000
#define WRT_PROT_SEC_14 0x00004000
#define WRT_PROT_SEC_13 0x00002000
#define WRT_PROT_SEC_12 0x00001000
#define WRT_PROT_SEC_11 0x00000800
#define WRT_PROT_SEC_10 0x00000400
#define WRT_PROT_SEC_9  0x00000200
#define WRT_PROT_SEC_8  0x00000100
#define WRT_PROT_SEC_7  0x00000080
#define WRT_PROT_SEC_6  0x00000040
#define WRT_PROT_SEC_5  0x00000020
#define WRT_PROT_SEC_4  0x00000010
#define WRT_PROT_SEC_3  0x00000008
#define WRT_PROT_SEC_2  0x00000004
#define WRT_PROT_SEC_1  0x00000002
#define WRT_PROT_SEC_0  0x00000001
/* Protect Sectors 32-63 */
#define CCFG_PROT_63_32     MMIO32(CCFG + 0xff4)
#define WRT_PROT_SEC_63 0x80000000
#define WRT_PROT_SEC_62 0x40000000
#define WRT_PROT_SEC_61 0x20000000
#define WRT_PROT_SEC_60 0x10000000
#define WRT_PROT_SEC_59 0x08000000
#define WRT_PROT_SEC_58 0x04000000
#define WRT_PROT_SEC_57 0x02000000
#define WRT_PROT_SEC_56 0x01000000
#define WRT_PROT_SEC_55 0x00800000
#define WRT_PROT_SEC_54 0x00400000
#define WRT_PROT_SEC_53 0x00200000
#define WRT_PROT_SEC_52 0x00100000
#define WRT_PROT_SEC_51 0x00080000
#define WRT_PROT_SEC_50 0x00040000
#define WRT_PROT_SEC_49 0x00020000
#define WRT_PROT_SEC_48 0x00010000
#define WRT_PROT_SEC_47 0x00008000
#define WRT_PROT_SEC_46 0x00004000
#define WRT_PROT_SEC_45 0x00002000
#define WRT_PROT_SEC_44 0x00001000
#define WRT_PROT_SEC_43 0x00000800
#define WRT_PROT_SEC_42 0x00000400
#define WRT_PROT_SEC_41 0x00000200
#define WRT_PROT_SEC_40 0x00000100
#define WRT_PROT_SEC_39 0x00000080
#define WRT_PROT_SEC_38 0x00000040
#define WRT_PROT_SEC_37 0x00000020
#define WRT_PROT_SEC_36 0x00000010
#define WRT_PROT_SEC_35 0x00000008
#define WRT_PROT_SEC_34 0x00000004
#define WRT_PROT_SEC_33 0x00000002
#define WRT_PROT_SEC_32 0x00000001
/* Protect Sectors 64-95 */
#define CCFG_PROT_95_64     MMIO32(CCFG + 0xff8)
#define WRT_PROT_SEC_95 0x80000000
#define WRT_PROT_SEC_94 0x40000000
#define WRT_PROT_SEC_93 0x20000000
#define WRT_PROT_SEC_92 0x10000000
#define WRT_PROT_SEC_91 0x08000000
#define WRT_PROT_SEC_90 0x04000000
#define WRT_PROT_SEC_89 0x02000000
#define WRT_PROT_SEC_88 0x01000000
#define WRT_PROT_SEC_87 0x00800000
#define WRT_PROT_SEC_86 0x00400000
#define WRT_PROT_SEC_85 0x00200000
#define WRT_PROT_SEC_84 0x00100000
#define WRT_PROT_SEC_83 0x00080000
#define WRT_PROT_SEC_82 0x00040000
#define WRT_PROT_SEC_81 0x00020000
#define WRT_PROT_SEC_80 0x00010000
#define WRT_PROT_SEC_79 0x00008000
#define WRT_PROT_SEC_78 0x00004000
#define WRT_PROT_SEC_77 0x00002000
#define WRT_PROT_SEC_76 0x00001000
#define WRT_PROT_SEC_75 0x00000800
#define WRT_PROT_SEC_74 0x00000400
#define WRT_PROT_SEC_73 0x00000200
#define WRT_PROT_SEC_72 0x00000100
#define WRT_PROT_SEC_71 0x00000080
#define WRT_PROT_SEC_70 0x00000040
#define WRT_PROT_SEC_69 0x00000020
#define WRT_PROT_SEC_68 0x00000010
#define WRT_PROT_SEC_67 0x00000008
#define WRT_PROT_SEC_66 0x00000004
#define WRT_PROT_SEC_65 0x00000002
#define WRT_PROT_SEC_64 0x00000001
/* Protect Sectors 96-127 */
#define CCFG_PROT_127_96    MMIO32(CCFG + 0xffc)
// 0: Sector protected
#define WRT_PROT_SEC_127 0x80000000
#define WRT_PROT_SEC_126 0x40000000
#define WRT_PROT_SEC_125 0x20000000
#define WRT_PROT_SEC_124 0x10000000
#define WRT_PROT_SEC_123 0x08000000
#define WRT_PROT_SEC_122 0x04000000
#define WRT_PROT_SEC_121 0x02000000
#define WRT_PROT_SEC_120 0x01000000
#define WRT_PROT_SEC_119 0x00800000
#define WRT_PROT_SEC_118 0x00400000
#define WRT_PROT_SEC_117 0x00200000
#define WRT_PROT_SEC_116 0x00100000
#define WRT_PROT_SEC_115 0x00080000
#define WRT_PROT_SEC_114 0x00040000
#define WRT_PROT_SEC_113 0x00020000
#define WRT_PROT_SEC_112 0x00010000
#define WRT_PROT_SEC_111 0x00008000
#define WRT_PROT_SEC_110 0x00004000
#define WRT_PROT_SEC_109 0x00002000
#define WRT_PROT_SEC_108 0x00001000
#define WRT_PROT_SEC_107 0x00000800
#define WRT_PROT_SEC_106 0x00000400
#define WRT_PROT_SEC_105 0x00000200
#define WRT_PROT_SEC_104 0x00000100
#define WRT_PROT_SEC_103 0x00000080
#define WRT_PROT_SEC_102 0x00000040
#define WRT_PROT_SEC_101 0x00000020
#define WRT_PROT_SEC_100 0x00000010
#define WRT_PROT_SEC_99  0x00000008
#define WRT_PROT_SEC_98  0x00000004
#define WRT_PROT_SEC_97  0x00000002
#define WRT_PROT_SEC_96  0x00000001

/* Misc configurations */
#define MISC_CONF_1                     MMIO32(FCFG1 + 0x0a0)
// HW minor revision number
#define DEVICE_MINOR_REV_MSK    0xff

/* MISC_CONF_2 Register */
#define MISC_CONF_2                     MMIO32(FCFG1 + 0x0a4)
// Default value holds log information from production test.
#define HPOSC_COMP_P3_MSK       0xff

/* CONFIG_RF_FRONTEND_DIVn Register */
#define CONFIG_RF_FRONTEND_DIV5         MMIO32(FCFG1 + 0x0c4)
#define CONFIG_RF_FRONTEND_DIV6         MMIO32(FCFG1 + 0x0c8)
#define CONFIG_RF_FRONTEND_DIV10        MMIO32(FCFG1 + 0x0cc)
#define CONFIG_RF_FRONTEND_DIV12        MMIO32(FCFG1 + 0x0d0)
#define CONFIG_RF_FRONTEND_DIV15        MMIO32(FCFG1 + 0x0d4)
#define CONFIG_RF_FRONTEND_DIV30        MMIO32(FCFG1 + 0x0d8)
//...
#define IFAMP_IB_MSK            0xf
#define IFAMP_IB_SFT            28
//...
#define LNA_IB_MSK              0xf
#define LNA_IB_SFT              24
//...
#define IFAMP_TRIM_MSK          0x1f
#define IFAMP_TRIM_SFT          19
//...
#define CTL_PA0_TRIM_MSK        0x1f
#define CTL_PA0_TRIM_SFT        14
//...
#define RFLDO_TRIM_OUTPUT_MSK   0x7f
#define RFLDO_TRIM_OUTPUT_MSK   0

/* CONFIG_SYNTH_DIVn Register */
#define CONFIG_SYNTH_DIV5               MMIO32(FCFG1 + 0x0dc)
#define CONFIG_SYNTH_DIV6               MMIO32(FCFG1 + 0x0e0)
#define CONFIG_SYNTH_DIV10              MMIO32(FCFG1 + 0x0e4)
#define CONFIG_SYNTH_DIV12              MMIO32(FCFG1 + 0x0e8)
#define CONFIG_SYNTH_DIV15              MMIO32(FCFG1 + 0x0ec)
#define CONFIG_SYNTH_DIV30              MMIO32(FCFG1 + 0x0f0)
//...
#define RFC_MDM_DEMIQMC0_MSK    0xffff
#define RFC_MDM_DEMIQMC0_SFT    12
//...
#define LDOVCO_TRIM_OUTPUT_MSK  0x3f
#define LDOVCO_TRIM_OUTPUT_SFT  6
//...
#define SLDO_TRIM_OUTPUT_MSK    0x3f
#define SLDO_TRIM_OUTPUT_SFT    0

/* */
#define CONFIG_MISC_ADC_DIV5            MMIO32(FCFG1 + 0x0f4)
#define CONFIG_MISC_ADC_DIV6            MMIO32(FCFG1 + 0x0f8)
#define CONFIG_MISC_ADC_DIV10           MMIO32(FCFG1 + 0x0fc)
#define CONFIG_MISC_ADC_DIV12           MMIO32(FCFG1 + 0x100)
#define CONFIG_MISC_ADC_DIV15           MMIO32(FCFG1 + 0x104)
#define CONFIG_MISC_ADC_DIV30           MMIO32(FCFG1 + 0x108)
//...
#define RSSI_OFFSET_MSK     0xff
#define RSSI_OFFSET_SFT     9
//...
#define QUANTCTLTHRES_MSK   0x7
#define QUANTCTLTHRES_SFT   6
//...
#define DACTRIM_MSK         0x3f
#define DACTRIM_SFT         0

/* Shadow of DIE_ID_0 register in eFuse */
#define SHDW_DIE_ID_0                   MMIO32(FCFG1 + 0x118)
//ID_31_0
/* Shadow of DIE_ID_1 register in eFuse */
#define SHDW_DIE_ID_1                   MMIO32(FCFG1 + 0x11c)
//ID_63_32
/* Shadow of DIE_ID_2 register in eFuse */
#define SHDW_DIE_ID_2                   MMIO32(FCFG1 + 0x120)
//ID_95_64
/* Shadow of DIE_ID_3 register in eFuse */
#define SHDW_DIE_ID_3                   MMIO32(FCFG1 + 0x124)
//ID_127_96

/* SHDW_OSC_BIAS_LDO_TRIM Register */
#define SHDW_OSC_BIAS_LDO_TRIM          MMIO32(FCFG1 + 0x138)
//...
#define SET_RCOSC_HF_COARSE_RESISTOR_SFT    27
#define SET_RCOSC_HF_COARSE_RESISTOR_MSK    0x3
//...
#define TRIMMAG_SFT                         23
#define TRIMMAG_MSK                         0xf
//...
#define TRIMIREF_SFT                        18
#define TRIMIREF_MSK                        0x1f
//...
#define ITRIM_DIG_LDO_SFT                   16
#define ITRIM_DIG_LDO_MSK                   0x3
//...
#define VTRIM_DIG_SFT                       12
#define VTRIM_DIG_MSK                       0xf
//...
#define VTRIM_COARSE_SFT                    8
#define VTRIM_COARSE_MSK                    0xf
//...
#define RCOSCHF_CTRIM_SFT                   0
#define RCOSCHF_CTRIM_MSK                   0xff

/* SHDW_ANA_TRIM Register */
#define SHDW_ANA_TRIM                   MMIO32(FCFG1 + 0x13c)
//...
#define BOD_BANDGAP_TRIM_CNF_SFT    25
#define BOD_BANDGAP_TRIM_CNF_MSK    0x3
//...
#define VDDR_ENABLE_PG1             0x1000000
//...
#define VDDR_OK_HYS                 0x0800000
//...
#define IPTAT_TRIM_SFT              21
#define IPTAT_TRIM_MSK              0x3
//...
#define VDDR_TRIM_SFT               16
#define VDDR_TRIM_MSK               0x1f
//...
#define TRIMBOD_INTMODE_SFT         11
#define TRIMBOD_INTMODE_MSK         0x1f
//...
#define TRIMBOD_EXTMODE_SFT         6
#define TRIMBOD_EXTMODE_MSK         0x1f
//...
#define TRIMTEMP_SFT                0
#define TRIMTEMP_MSK                0x3f

/* FLASH_NUMBER Register */
#define FLASH_NUMBER                    MMIO32(FCFG1 + 0x164)
//Number of the manufacturing lot that produced this unit.
//LOT_NUMBER

