dltech/headphones/lib/cc2640_reg/fcfg_reg.h
/* FLASH_COORDINATE Register */
#define FLASH_COORDINATE                MMIO32(FCFG1 + 0x16c)
//X coordinate of this unit on the wafer.
#define XCOORDINATE_SFT 16
#define XCOORDINATE_MSK 0xffff
//Y coordinate of this unit on the wafer.
#define YCOORDINATE_SFT 0
#define YCOORDINATE_MSK 0xffff

/* FLASH_E_P Register */
#define FLASH_E_P                       MMIO32(FCFG1 + 0x170)
//...
#define PSU_SFT     24
#define PSU_MSK     0xff
//...
#define ESU_SFT     16
#define ESU_MSK     0xff
//...
#define PVSU_SFT    8
#define PVSU_MSK    0xff
//...
#define EVSU_SFT    0
#define EVSU_MSK    0xff

/* FLASH_C_E_P_R Register */
#define FLASH_C_E_P_R                   MMIO32(FCFG1 + 0x174)
//...
#define RVSU_SFT            24
#define RVSU_MSK            0xff
//...
#define PV_ACCESS_SFT       16
#define PV_ACCESS_MSK       0xff
//...
#define A_EXEZ_SETUP_SFT    12
#define A_EXEZ_SETUP_MSK    0xf
//...
#define CVSU_SFT            0
#define CVSU_MSK            0xfff

/* FLASH_P_R_PV Register */
#define FLASH_P_R_PV                    MMIO32(FCFG1 + 0x178)
//...
#define PH_SFT     24
#define PH_MSK     0xff
//...
#define RH_SFT     16
#define RH_MSK     0xff
//...
#define PVH_SFT    8
#define PVH_MSK    0xff
//...
#define PVH2_SFT   0
#define PVH2_MSK   0xff

/* FLASH_EH_SEQ Register */
#define FLASH_EH_SEQ                    MMIO32(FCFG1 + 0x17c)
//...
#define EH_SFT              24
#define EH_MSK              0xff
//...
#define SEQ_SFT             16
#define SEQ_MSK             0xff
//...
#define VSTAT_SFT           12
#define VSTAT_MSK           0xf
//...
#define SM_FREQUENCY_SFT    0
#define SM_FREQUENCY_MSK    0xfff

/* FLASH_VHV_E Register */
#define FLASH_VHV_E                     MMIO32(FCFG1 + 0x180)
//...
#define VHV_E_START_SFT         16
#define VHV_E_START_MSK         0xffff
//...
#define VHV_E_STEP_HIGHT_SFT    0
#define VHV_E_STEP_HIGHT_MSK    0xffff

/* FLASH_PP Register */
#define FLASH_PP                        MMIO32(FCFG1 + 0x184)
//...
#define PUMP_SU_SFT 24
#define PUMP_SU_MSK 0xff
//...
#define MAX_PP_SFT  0
#define MAX_PP_MSK  0xffff

/* FLASH_PROG_EP Register */
#define FLASH_PROG_EP                   MMIO32(FCFG1 + 0x188)
//...
#define MAX_EP_SFT      16
#define MAX_EP_MSK      0xffff
//...
#define PROGRAM_PW_SFT  0
#define PROGRAM_PW_MSK  0xffff

/* FLASH_ERA_PW Register */
#define FLASH_ERA_PW                    MMIO32(FCFG1 + 0x18c)
// ERASE_PW

/* */
#define FLASH_VHV                       MMIO32(FCFG1 + 0x190)
//...
#define TRIM13_P_SFT    24
#define TRIM13_P_MSK    0xf
//...
#define VHV_P_SFT       16
#define VHV_P_MSK       0xf
//...
#define TRIM13_E_SFT    8
#define TRIM13_E_MSK    0xf
//...
#define VHV_E_SFT       0
#define VHV_E_MSK       0xf

/* FLASH_VHV_PV Register */
#define FLASH_VHV_PV                    MMIO32(FCFG1 + 0x194)
//...
#define TRIM13_PV_SFT   24
#define TRIM13_PV_MSK   0xf
//...
#define VHV_PV_SFT      16
#define VHV_PV_MSK      0xf
//...
#define VCG2P5_SFT      8
#define VCG2P5_MSK      0xf
//...
#define VINH_SFT        0
#define VINH_MSK        0xf

/* FLASH_V Register */
#define FLASH_V                         MMIO32(FCFG1 + 0x198)
//...
#define VSL_P_SFT   24
#define VSL_P_MSK   0xff
//...
#define VWL_P_SFT   16
#define VWL_P_MSK   0xff
//...
#define V_READ_SFT  8
#define V_READ_MSK  0xff

/* User Identification. */
#define USER_ID                         MMIO32(FCFG1 + 0x294)
//...
#define PG_REV_SFT      28
#define PG_REV_MSK      0xf
//...
#define VER_SFT         26
#define VER_MSK         0x3
//...
#define SEQUENCE_SFT    19
#define SEQUENCE_MSK    0xf
//...
#define PKG_SFT         16
#define PKG_MSK         0x7
//...
#define PROTOCOL_SFT    12
#define PROTOCOL_MSK    0xf

/* FLASH_OTP_DATA3 Register */
#define FLASH_OTP_DATA3                 MMIO32(FCFG1 + 0x2b0)
//...
#define EC_STEP_SIZE_SFT    24
#define EC_STEP_SIZE_MSK    0x1ff
//...
#define DO_PRECOND          0x400000
//...
#define MAX_EC_LEVEL_SFT    18
#define MAX_EC_LEVEL_MSK    0xf
//...
#define TRIM_1P7_SFT        16
#define TRIM_1P7_MSK        0x3
//...
#define FLASH_SIZEE_SFT     8
#define FLASH_SIZE_MSK      0xff
//...
#define WAIT_SYSCODE_SFT    0
#define WAIT_SYSCODE_MSK    0xff

/* ANA2_TRIM Register */
#define ANA2_TRIM                       MMIO32(FCFG1 + 0x2b4)
//...
#define RCOSCHFCTRIMFRACT_EN            0x80000000
//...
#define RCOSCHFCTRIMFRACT_SFT           26
#define RCOSCHFCTRIMFRACT_MSK           0x1f
//...
#define SET_RCOSC_HF_FINE_RESISTOR_SFT  23
#define SET_RCOSC_HF_FINE_RESISTOR_MSK  0x3
//...
#define ATESTLF_UDIGLDO_IBIAS_TRIM      0x00400000
//...
#define NANOAMP_RES_TRIM_SFT            16
#define NANOAMP_RES_TRIM_MSK            0x3f
//...
#define DITHER_EN                       0x00000800
//...
#define DCDC_IPEAK_SFT                  8
#define DCDC_IPEAK_MSK                  0x7
//...
#define DEAD_TIME_TRIM_SFT              6
#define DEAD_TIME_TRIM_MSK              0x3
//...
#define DCDC_LOW_EN_SEL_SFT             3
#define DCDC_LOW_EN_SEL_MSK             0x7
//...
#define DCDC_HIGH_EN_SEL_SFT            0
#define DCDC_HIGH_EN_SEL_MSK            0x7

/* LDO_TRIM Register */
#define LDO_TRIM                        MMIO32(FCFG1 + 0x2b8)
//...
#define VDDR_TRIM_SLEEP_SFT     24
#define VDDR_TRIM_SLEEP_MSK     0x1f
//...
#define GLDO_CURSRC_SFT         16
#define GLDO_CURSRC_MSK         0x7
//...
#define ITRIM_DIGLDO_LOAD_SFT   11
#define ITRIM_DIGLDO_LOAD_MSK   0x3
//...
#define ITRIM_UDIGLDO_SFT       8
#define ITRIM_UDIGLDO_MSK       0x7
//...
#define VTRIM_DELTA_SFT         0
#define VTRIM_DELTA_MSK         0x7

/* MAC_BLE_0 Register */
#define MAC_BLE_0                       MMIO32(FCFG1 + 0x2e8)
// ADDR_0_31
/* MAC_BLE_1 Register */
#define MAC_BLE_1                       MMIO32(FCFG1 + 0x2ec)
// ADDR_32_63

/* MAC IEEE 802.15.4 Address 0 */
#define MAC_15_4_0                      MMIO32(FCFG1 + 0x2f0)
// ADDR_0_31
/* MAC IEEE 802.15.4 Address 1 */
#define MAC_15_4_1                      MMIO32(FCFG1 + 0x2f4)
//ADDR_32_63

/* FLASH_OTP_DATA4 Register */
#define FLASH_OTP_DATA4                 MMIO32(FCFG1 + 0x308)
//...
#define STANDBY_MODE_SEL_INT_WRT    0x80000000
//...
#define STANDBY_PW_SEL_INT_WRT_SFT  29
#define STANDBY_PW_SEL_INT_WRT_MSK  0x3
//...
#define DIS_STANDBY_INT_WRT         0x10000000
//...
#define DIS_IDLE_INT_WRT            0x08000000
//...
#define VIN_AT_X_INT_WRT_SFT        24
#define VIN_AT_X_INT_WRT_MSK        0x7
//...
#define STANDBY_MODE_SEL_EXT_WRT    0x00800000
//...
#define STANDBY_PW_SEL_EXT_WRT_SFT  21
#define STANDBY_PW_SEL_EXT_WRT_MSK  0x3
//...
#define DIS_STANDBY_EXT_WRT         0x00100000
//...
#define DIS_IDLE_EXT_WRT            0x00080000
//...
#define VIN_AT_X_EXT_WRT_SFT        16
#define VIN_AT_X_EXT_WRT_MSK        0x7
//...
#define STANDBY_MODE_SEL_INT_RD     0x00008000
//...
#define STANDBY_PW_SEL_INT_RD_SFT   13
#define STANDBY_PW_SEL_INT_RD_MSK   0x3
//...
#define DIS_STANDBY_INT_RD          0x00001000
//...
#define DIS_IDLE_INT_RD_WRT         0x00000800
//...
#define VIN_AT_X_INT_RD_SFT         8
#define VIN_AT_X_INT_RD_MSK         0x7
//...
#define STANDBY_MODE_SEL_EXT_RD     0x00000080
//...
#define STANDBY_PW_SEL_EXT R_RD_SFT 5
#define STANDBY_PW_SEL_EXT R_RD_MSK 0x3
//...
#define DIS_STANDBY_EXT_RD_WRT      0x00000010
//...
#define DIS_IDLE_EXT_RD_WRT         0x00000008
//...
#define VIN_AT_X_EXT_RD_SFT         0
#define VIN_AT_X_EXT_RD_MSK         0x7

/* Miscellaneous Trim Parameters */
#define MISC_TRIM                       MMIO32(FCFG1 + 0x30c)
//...
#define TEMPVSLOPE_SFT  0
#define TEMPVSLOPE_MSK  0xff

