dltech/headphones/lib/cc2640_reg/fcfg_reg.h
/* RCOSC_HF_TEMPCOMP Register */
#define RCOSC_HF_TEMPCOMP               MMIO32(FCFG1 + 0x310)
//...
#define FINE_RESISTOR_SFT       24
#define FINE_RESISTOR_MSK       0xff
//...
#define CTRIM_SFT               16
#define CTRIM_MSK               0xff
//...
#define CTRIMFRACT_QUAD_SFT     8
#define CTRIMFRACT_QUAD_MSK     0xff
//...
#define CTRIMFRACT_SLOPE_SFT    0
#define CTRIMFRACT_SLOPE_MSK    0xff

/* IcePick Device Identification */
#define ICEPICK_DEVICE_ID               MMIO32(FCFG1 + 0x318)
// Field used to distinguish revisions of the device.
#define CTRIM_SFT           28
#define CTRIM_MSK           0xf
// Field used to identify silicon die.
#define WAFER_ID_SFT        12
#define WAFER_ID_MSK        0xffff
// Manufacturer code.
#define MANUFACTURER_ID_SFT 0
#define MANUFACTURER_ID_MSK 0xfff

/* Factory Configuration (FCFG1) Revision */
#define FCFG1_REVISION                  MMIO32(FCFG1 + 0x31c)
//REV

/* Misc OTP Data */
#define MISC_OTP_DATA                   MMIO32(FCFG1 + 0x320)
//...
#define RCOSC_HF_ITUNE_SFT      28
#define RCOSC_HF_ITUNE_MSK      0xf
//...
#define RCOSC_HF_CRIM_SFT       20
#define RCOSC_HF_CRIM_MSK       0xff
//...
#define PER_M_SFT               15
#define PER_M_MSK               0x1ff
//...
#define PER_E_SFT               12
#define PER_E_MSK               0x7
//...
#define PO_TAIL_RES_TRIM_SFT    8
#define PO_TAIL_RES_TRIM_MSK    0xf
//The revision of the test program used in the production process.
#define TEST_PROGRAM_REV_SFT    0
#define TEST_PROGRAM_REV_MSK    0xff

/* IO Configuration */
#define IOCONF                          MMIO32(FCFG1 + 0x344)
// Number of available DIOs.
#define GPIO_CNT_SFT    0
#define GPIO_CNT_MSK    0x7f

/* CONFIG_IF_ADC Register */
#define CONFIG_IF_ADC                   MMIO32(FCFG1 + 0x34c)
//...
#define FF2ADJ_SFT                  28
#define FF2ADJ_MSK                  0xf
//...
#define FF3ADJ_SFT                  24
#define FF3ADJ_MSK                  0xf
//...
#define INT3ADJ_SFT                 20
#define INT3ADJ_MSK                 0xf
//...
#define FF1ADJ_SFT                  16
#define FF1ADJ_MSK                  0xf
//...
#define AAFCAP_SFT                  14
#define AAFCAP_MSK                  0x3
//...
#define INT2ADJ_SFT                 10
#define INT2ADJ_MSK                 0xf
//...
#define IFDIGLDO_TRIM_OUTPUT_SFT    5
#define IFDIGLDO_TRIM_OUTPUT_MSK    0x1f
//...
#define IFANALDO_TRIM_OUTPUT_SFT    0
#define IFANALDO_TRIM_OUTPUT_MSK    0x1f

/* CONFIG_OSC_TOP Register */
#define CONFIG_OSC_TOP                  MMIO32(FCFG1 + 0x350)
//...
#define XOSC_HF_ROW_Q12_SFT     26
#define XOSC_HF_ROW_Q12_MSK     0xf
//...
#define XOSC_HF_COLUMN_Q12_SFT  10
#define XOSC_HF_COLUMN_Q12_MSK  0xffff
//...
#define RCOSCLF_CTUNE_TRIM_SFT  2
#define RCOSCLF_CTUNE_TRIM_MSK  0xff
//...
#define RCOSCLF_RTUNE_TRIM_SFT  0
#define RCOSCLF_RTUNE_TRIM_MSK  0x3

/* CONFIG_RF_FRONTEND Register */
#define CONFIG_RF_FRONTEND              MMIO32(FCFG1 + 0x354)
//...
#define IFAMP_IB_SFT            28
#define IFAMP_IB_MSK            0xf
//...
#define LNA_IB_SFT              24
#define LNA_IB_MSK              0xf
//...
#define IFAMP_TRIM_SFT          19
#define IFAMP_TRIM_MSK          0x1f
//...
#define CTL_PA0_TRIM_SFT        14
#define CTL_PA0_TRIM_MSK        0x1f
//...
#define PATRIMCOMPLETE_N_MSK    0x2000
//...
#define RFLDO_TRIM_OUTPUT_SFT   0
#define RFLDO_TRIM_OUTPUT_MSK   0x7f

/* CONFIG_SYNTH Register */
#define CONFIG_SYNTH                    MMIO32(FCFG1 + 0x358)
//...
#define RFC_MDM_DEMIQMC0_SFT    12
#define RFC_MDM_DEMIQMC0_MSK    0xffff
//...
#define LDOVCO_TRIM_OUTPUT_SFT  6
#define LDOVCO_TRIM_OUTPUT_MSK  0x3f
//...
#define SLDO_TRIM_OUTPUT_SFT    0
#define SLDO_TRIM_OUTPUT_MSK    0x3f

/* AUX_ADC Gain in Absolute Reference Mode */
#define SOC_ADC_ABS_GAIN                MMIO32(FCFG1 + 0x35c)
// SOC_ADC gain in absolute reference mode at temperature 1 (30C).
#define SOC_ADC_ABS_GAIN_TEMP1_SFT    0
#define SOC_ADC_ABS_GAIN_TEMP1_MSK    0xffff

/* AUX_ADC Gain in Relative Reference Mode */
#define SOC_ADC_REL_GAIN                MMIO32(FCFG1 + 0x360)
// SOC_ADC gain in relative reference mode at temperature 1 (30C).
#define SOC_ADC_REL_GAIN_TEMP1_SFT    0
#define SOC_ADC_REL_GAIN_TEMP1_MSK    0xffff

/* AUX_ADC Temperature Offsets in Absolute Reference Mode */
#define SOC_ADC_OFFSET_INT              MMIO32(FCFG1 + 0x368)
// SOC_ADC offset in relative reference mode at temperature 1 (30C).
#define SOC_ADC_REL_OFFSET_TEMP1_SFT    16
#define SOC_ADC_REL_OFFSET_TEMP1_MSK    0xff
// SOC_ADC offset in absolute reference mode at temperature 1 (30C).
#define SOC_ADC_ABS_OFFSET_TEMP1_SFT    0
#define SOC_ADC_ABS_OFFSET_TEMP1_MSK    0xff

/* SOC_ADC_REF_TRIM_AND_OFFSET_EXT Register */
#define SOC_ADC_REF_TRIM_AND_OFFSET_EXT MMIO32(FCFG1 + 0x36c)
//...
#define SOC_ADC_REF_VOLTAGE_TRIM_TEMP1_SFT    0
#define SOC_ADC_REF_VOLTAGE_TRIM_TEMP1_MSK    0x3f

/* AMPCOMP_TH1 Register */
#define AMPCOMP_TH1                     MMIO32(FCFG1 + 0x370)
//...
#define HPMRAMP3_LTH_SFT            18
#define HPMRAMP3_LTH_MSK            0x3f
//...
#define HPMRAMP3_HTH_SFT            10
#define HPMRAMP3_HTH_MSK            0x3f
//...
#define IBIASCAP_LPTOHP_OL_CNT_SFT  6
#define IBIASCAP_LPTOHP_OL_CNT_MSK  0xf
//...
#define HPMRAMP1_TH_SFT             0
#define HPMRAMP1_TH_MSK             0x3f

/* AMPCOMP_TH2 Register */
#define AMPCOMP_TH2                     MMIO32(FCFG1 + 0x374)
//...
#define LPMUPDATE_LTH_SFT       26
#define LPMUPDATE_LTH_MSK       0x3f
//...
#define LPMUPDATE_HTM_SFT       18
#define LPMUPDATE_HTM_MSK       0x3f
//...
#define ADC_COMP_AMPTH_LPM_SFT  10
#define ADC_COMP_AMPTH_LPM_MSK  0xf
//...
#define ADC_COMP_AMPTH_HPM_SFT  0
#define ADC_COMP_AMPTH_HPM_MSK  0x3f

/* AMPCOMP_CTRL1 Register */
#define AMPCOMP_CTRL1                   MMIO32(FCFG1 + 0x378)
//...
#define AMPCOMP_REQ_MODE                0x40000000
//...
#define IBIAS_OFFSET_SFT                20
#define IBIAS_OFFSET_MSK                0xf
//...
#define IBIAS_INIT_SFT                  16
#define IBIAS_INIT_MSK                  0xf
//...
#define LPM_IBIAS_WAIT_CNT_FINAL_SFT    8
#define LPM_IBIAS_WAIT_CNT_FINAL_MSK    0xff
//...
#define CAP_STEP_SFT                    4
#define CAP_STEP_MSK                    0xf
//...
#define IBIASCAP_HPTOLP_OL_CNT_SFT      0
#define IBIASCAP_HPTOLP_OL_CNT_MSK      0xf

/* ANABYPASS_VALUE2 Register */
#define ANABYPASS_VALUE2                MMIO32(FCFG1 + 0x37c)
//...
#define XOSC_HF_IBIASTHERM_SFT  0
#define XOSC_HF_IBIASTHERM_MSK  0x3fff

/* CONFIG_MISC_ADC Register */
#define CONFIG_MISC_ADC                 MMIO32(FCFG1 + 0x380)
//...
#define RSSITRIMCOMPLETE_N  0x00020000
//...
#define RSSI_OFFSET_SFT     9
#define RSSI_OFFSET_MSK     0xff
//...
#define QUANTCTLTHRES_SFT   6
#define QUANTCTLTHRES_MSK   0x7
//...
#define DACTRIM_SFT         0
#define DACTRIM_MSK         0x3f

