dltech/headphones/lib/cc2640_reg/fcfg_reg.h
/* VOLT_TRIM Register */
#define VOLT_TRIM                       MMIO32(FCFG1 + 0x388)
//...
#define VDDR_TRIM_HH_SFT        24
#define VDDR_TRIM_HH_MSK        0x1f
//...
#define VDDR_TRIM_H_SFT         16
#define VDDR_TRIM_H_MSK         0x1f
//...
#define VDDR_TRIM_SLEEP_H_SFT   8
#define VDDR_TRIM_SLEEP_H_MSK   0x1f
//...
#define TRIMBOD_H_SFT           0
#define TRIMBOD_H_MSK           0x1f

/* OSC Configuration */
#define OSC_CONF                        MMIO32(FCFG1 + 0x38c)
// Trim value for DDI_0_OSC:ADCDOUBLERNANOAMPCTL.ADC_SH_VBUF_EN.
#define ADC_SH_VBUF_EN                  0x20000000
// Trim value for DDI_0_OSC:ADCDOUBLERNANOAMPCTL.ADC_SH_MODE_EN.
#define ADC_SH_MODE_EN                  0x10000000
// Trim value for DDI_0_OSC:ATESTCTL.ATESTLF_RCOSCLF_IBIAS_TRIM.
#define ATESTLF_RCOSCLF_IBIAS_TRIM      0x08000000
// Trim value for DDI_0_OSC:LFOSCCTL.XOSCLF_REGULATOR_TRIM.
#define XOSCLF_REGULATOR_TRIM_SFT       25
#define XOSCLF_REGULATOR_TRIM_MSK       0x3
// Trim value for DDI_0_OSC:LFOSCCTL.XOSCLF_CMIRRWR_RATIO.
#define XOSCLF_CMIRRWR_RATIO_SFT        21
#define XOSCLF_CMIRRWR_RATIO_MSK        0xf
// Trim value for DDI_0_OSC:LFOSCCTL.XOSCLF_CMIRRWR_RATIO.
#define XOSC_HF_FAST_START_SFT          19
#define XOSC_HF_FAST_START_MSK          0x3
// 1: XOSC_HF available (default)
#define XOSC_OPTION                     0x00040000
//...
#define HPOSC_OPTION                    0x00020000
//...
#define HPOSC_BIAS_HOLD_MODE_EN         0x00010000
//...
#define HPOSC_CURRMIRR_RATIO_SFT        12
#define HPOSC_CURRMIRR_RATIO_MSK        0xf
//...
#define HPOSC_BIAS_RES_SET_SFT          8
#define HPOSC_BIAS_RES_SET_MSK          0xf
//...
#define HPOSC_FILTER_EN                 0x00000080
//...
#define HPOSC_BIAS_RECHARGE_DELAY_SFT   5
#define HPOSC_BIAS_RECHARGE_DELAY_MSK   0x3
//...
#define HPOSC_SERIES_CAP_SFT            1
#define HPOSC_SERIES_CAP_MSK            0x3
//...
#define HPOSC_DIV3_BYPASS               0x00000001

/* FREQ_OFFSET Register */
#define FREQ_OFFSET                     MMIO32(FCFG1 + 0x390)
//...
#define HPOSC_COMP_P0_SFT   16
#define HPOSC_COMP_P0_MSK   0xffff
//...
#define HPOSC_COMP_P1_SFT   8
#define HPOSC_COMP_P1_MSK   0xff
//...
#define HPOSC_COMP_P2_SFT   0
#define HPOSC_COMP_P2_MSK   0xff

/* CAP_TRIM Register */
#define CAP_TRIM                        MMIO32(FCFG1 + 0x394)
//...
#define FLUX_CAP_0P28_TRIM_SFT  16
#define FLUX_CAP_0P28_TRIM_MSK  0xffff
//...
#define FLUX_CAP_0P4_TRIM_SFT   0
#define FLUX_CAP_0P4_TRIM_MSK   0xffff

/* MISC_OTP_DATA_1 Register */
#define MISC_OTP_DATA_1                 MMIO32(FCFG1 + 0x398)
//...
#define PEAK_DET_ITRIM_SFT                  27
#define PEAK_DET_ITRIM_MSK                  0x3
//...
#define HP_BUF_ITRIM_SFT                    24
#define HP_BUF_ITRIM_MSK                    0x7
//...
#define LP_BUF_ITRIM_SFT                    22
#define LP_BUF_ITRIM_MSK                    0x3
//...
#define DBLR_LOOP_FILTER_RESET_VOLTAGE_SFT  20
#define DBLR_LOOP_FILTER_RESET_VOLTAGE_MSK  0x3
//...
#define HPM_IBIAS_WAIT_CNT_SFT              10
#define HPM_IBIAS_WAIT_CNT_MSK              0x3ff
//...
#define LPM_IBIAS_WAIT_CNT_SFT              4
#define LPM_IBIAS_WAIT_CNT_MSK              0x3f
//...
#define IDAC_STEP_SFT                       0
#define IDAC_STEP_MSK                       0xf

/* Power Down Current Control xC */
#define PWD_CURR_20C                    MMIO32(FCFG1 + 0x39c)
#define PWD_CURR_35C                    MMIO32(FCFG1 + 0x3a0)
#define PWD_CURR_50C                    MMIO32(FCFG1 + 0x3a4)
#define PWD_CURR_65C                    MMIO32(FCFG1 + 0x3a8)
#define PWD_CURR_80C                    MMIO32(FCFG1 + 0x3ac)
#define PWD_CURR_95C                    MMIO32(FCFG1 + 0x3b0)
#define PWD_CURR_110C                   MMIO32(FCFG1 + 0x3b4)
#define PWD_CURR_125C                   MMIO32(FCFG1 + 0x3b8)
// Additional maximum current, in units of 1uA, with cache retention
#define DELTA_CACHE_REF_SFT 24
#define DELTA_CACHE_REF_MSK 0xff
// Additional maximum current, in 1uA units, with RF memory retention
#define DELTA_RFMEM_RET_SFT 16
#define DELTA_RFMEM_RET_MSK 0xff
// Additional maximum current, in units of 1uA, with XOSC_HF on in low-powermode
#define DELTA_XOSC_LPM_SFT  8
#define DELTA_XOSC_LPM_MSK  0xff
// Worst-case baseline maximum powerdown current, in units of 0.5uA
#define BASELINE_SFT        0
#define BASELINE_MSK        0xff

#endif
